# Описание функций приложения
## Основной экран

На основном экране приложения находятся панели двух игроков и общее игровое поле.
!(Deck_Main_1200x800.png)

Панели игроков: 
- сумма очков карт в тайнике
- никнейм
- изображение персонажа

### Игра

!(Deck_Bust_1.png)

Игровое поле:
- колода с количеством оставшихся карт
- выложенные карты (дубликаты обводятся в красную рамку)
- кнопка завершения хода (по окончании хода все краты отправляются в тайник к игроку, и их сумма прибавляется к очкам игрока)

### Проигрыш

!(Deck_Bust_2.png)
!(Deck_Bust_3.png)
!(Deck_Win.png)

Сначала игровое поле перекрывается изображением "bust", после чего остаюся только:
- кнопка начала новой игры
- никнейм победителя
